<script setup>
import {useStore} from "vuex";
import {ElMessage} from "element-plus";
import {useRouter} from "vue-router";

const store = useStore()
const router = useRouter()

function logout() {
  store.dispatch('logout').then(() => {
    ElMessage({message: '退出登录成功', type: 'success', showClose: true});
    router.push({path: '/'});
  }).catch((error) => {
    if (error !== 'error') {
      ElMessage({message: error, type: 'error', showClose: true});
    }
  });
}
</script>

<template>
  <el-row :gutter="10" style="margin: 5vh 0 5vh 0">
    <el-col :span="9" :offset="2" class="card">
      <router-link to="/admin/users/manage" class="no-decoration">
        <div class="center">
          <svg t="1715495030355" class="icon" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg"
               p-id="1499" width="200" height="200">
            <path
                d="M727.04 931.84c-20.48 0-40.96-15.36-40.96-40.96v-87.04c0-35.84-15.36-66.56-40.96-92.16s-56.32-40.96-92.16-40.96H215.04c-35.84 0-66.56 15.36-92.16 40.96s-40.96 56.32-40.96 92.16v87.04c0 20.48-15.36 40.96-40.96 40.96s-40.96-15.36-40.96-40.96v-87.04c0-56.32 20.48-107.52 61.44-148.48 40.96-40.96 92.16-61.44 148.48-61.44h343.04c56.32 0 107.52 20.48 148.48 61.44 40.96 40.96 61.44 92.16 61.44 148.48v87.04c0 25.6-15.36 40.96-35.84 40.96zM384 506.88c-117.76 0-209.92-92.16-209.92-209.92s92.16-209.92 209.92-209.92 209.92 92.16 209.92 209.92-92.16 209.92-209.92 209.92z m0-343.04c-71.68 0-133.12 61.44-133.12 133.12s61.44 133.12 133.12 133.12 133.12-61.44 133.12-133.12-61.44-133.12-133.12-133.12zM983.04 931.84c-20.48 0-40.96-15.36-40.96-40.96v-87.04c0-30.72-10.24-56.32-25.6-81.92s-40.96-40.96-71.68-46.08c-20.48-5.12-30.72-25.6-25.6-46.08s25.6-30.72 46.08-25.6c46.08 10.24 87.04 35.84 112.64 76.8 30.72 35.84 46.08 81.92 46.08 128v87.04c-5.12 20.48-20.48 35.84-40.96 35.84zM680.96 501.76c-15.36 0-30.72-10.24-35.84-30.72-5.12-20.48 5.12-40.96 25.6-46.08 30.72-5.12 56.32-25.6 71.68-46.08 20.48-25.6 25.6-51.2 25.6-81.92s-10.24-56.32-25.6-81.92-40.96-40.96-71.68-46.08c-20.48-5.12-30.72-25.6-25.6-46.08s25.6-30.72 46.08-25.6c46.08 10.24 87.04 35.84 112.64 76.8 30.72 35.84 46.08 81.92 46.08 128s-15.36 92.16-46.08 128-66.56 61.44-112.64 76.8c0-5.12-5.12-5.12-10.24-5.12z"
                fill="#fdfdcb" p-id="1500"></path>
          </svg>
        </div>
        <h2 class="center">用户管理</h2>
      </router-link>
    </el-col>
    <el-col :span="9" :offset="2" class="card">
      <router-link to="/admin/curriculums/manage" class="no-decoration">
        <div class="center">
          <svg t="1715505071329" class="icon" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg"
               p-id="2676" width="200" height="200">
            <path
                d="M264.9 390.1h127.2v127.2H264.9V390.1z m184.7 0h127.2v127.2H449.6V390.1z m184.6 0h127.2v127.2H634.2V390.1z m6.2 44.7M264.9 597.8h127.2V725H264.9V597.8z m184.7 0h127.2V725H449.6V597.8z m184.6 0h127.2V725H634.2V597.8z m6.2 0"
                fill="#fdfdcb" p-id="2677"></path>
            <path
                d="M825 201v626.1H198.8V201H825m10-70H188.8c-33 0-60 27-60 60v646.1c0 33 27 60 60 60H835c33 0 60-27 60-60V191c0-33-27-60-60-60z"
                fill="#fdfdcb" p-id="2678"></path>
            <path d="M192.2 201.4h639.2v74H192.2z" fill="#fdfdcb" p-id="2679"></path>
            <path d="M806.4 226.4v24H217.2v-24h589.2m50-50H167.2v124h689.2v-124z" fill="#fdfdcb" p-id="2680"></path>
          </svg>
        </div>
        <h2 class="center">课程组管理</h2>
      </router-link>
    </el-col>
  </el-row>
  <el-row :gutter="10">
    <el-col :span="9" :offset="2" class="card">
      <router-link to="/admin/courses/manage" class="no-decoration">
        <div class="center">
          <svg t="1716871535734" class="icon" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg"
               p-id="2753" width="200" height="200">
            <path
                d="M982.4 256a43.52 43.52 0 0 0-28.8-40.96L526.08 64a42.24 42.24 0 0 0-28.16 0L70.4 216.32a43.52 43.52 0 0 0 0 81.28l428.16 153.6a42.24 42.24 0 0 0 28.16 0l428.16-153.6a43.52 43.52 0 0 0 27.52-41.6zM512 364.8L213.12 256 512 154.88 810.24 256z"
                fill="#fdfdcb" p-id="2754"></path>
            <path
                d="M980.48 416a43.52 43.52 0 0 0-53.12-32L512 534.4l-414.08-147.2a42.88 42.88 0 0 0-54.4 26.24 46.72 46.72 0 0 0 26.24 56.96l428.16 149.76a42.24 42.24 0 0 0 28.16 0l428.16-149.76a43.52 43.52 0 0 0 26.24-54.4zM980.48 753.28a42.88 42.88 0 0 0-53.12-28.8L512 871.68l-414.08-147.2a42.88 42.88 0 0 0-54.4 26.24 47.36 47.36 0 0 0 26.24 57.6L497.92 960a42.24 42.24 0 0 0 28.16 0l428.16-149.12a44.8 44.8 0 0 0 26.24-57.6z"
                fill="#fdfdcb" p-id="2755"></path>
            <path
                d="M980.48 588.16a42.88 42.88 0 0 0-53.12-28.8L512 704 97.92 559.36a42.88 42.88 0 0 0-54.4 26.24 47.36 47.36 0 0 0 26.24 57.6l428.16 149.12a42.24 42.24 0 0 0 28.16 0l428.16-149.12a44.8 44.8 0 0 0 26.24-55.04z"
                fill="#fdfdcb" p-id="2756"></path>
          </svg>
        </div>
        <h2 class="center">课程管理</h2>
      </router-link>
    </el-col>
    <el-col :span="9" :offset="2" class="card">
      <!--暂定/logout-->
      <div class="no-decoration" @click="logout">
        <div class="center">
          <svg t="1715508107688" class="icon" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg"
               p-id="6180" width="200" height="200">
            <path
                d="M599.36 643.36V786.4c0 17.792-14.304 32.224-31.936 32.224H114.88c-17.632 0-31.936-14.432-31.936-32.224V237.6c0-17.792 14.304-32.224 31.936-32.224h452.544c17.632 0 31.936 14.432 31.936 32.224v143.04h-64.544v-78.048c0-13.568-10.72-24.608-23.936-24.608H171.488c-13.248 0-23.968 11.008-23.968 24.608v418.816c0 13.568 10.72 24.576 23.968 24.576H510.88c13.216 0 23.936-11.008 23.936-24.576V643.36h64.544z m295.392-163.936H322.464v72.384h572.288v-72.352z m46.336 28.992L752 319.296l-55.52 55.52L885.6 563.904l55.488-55.488z m-55.52-52.448L692.352 649.184l55.52 55.52 193.184-193.216-55.488-55.52z"
                fill="#d81e06" p-id="6181"></path>
          </svg>
        </div>
        <h2 class="center" style="color: #d71e06">退出登录</h2>
      </div>
    </el-col>
  </el-row>
</template>

<style scoped>
.card {
  border-radius: 5%;
  background-color: #264b5d;
  box-shadow: 10px 10px 10px 2px gray;
}

h2 {
  color: #fdfdcb;
  padding-bottom: 10px;
}
</style>